pmo-dataset/variations/mermaid_basic/37.mmd
graph LR
	StartEvent_1(("Contract project received")) --> ExclusiveGateway_1{"X"}
	ExclusiveGateway_1 --> Task_1["Query the next shop"]
	Task_3["Create a list of the parts"] --> ExclusiveGateway_3{"X"}
	Task_1 --> Task_2["Ask about quantity, price and deadline"]
	Task_2 --> ExclusiveGateway_2{"Terms acceptable?"}
	ExclusiveGateway_2 -->|"No"| ExclusiveGateway_3
	ExclusiveGateway_2 -->|"Yes"| Task_3
	ExclusiveGateway_3 --> ExclusiveGateway_4{"More parts needed?"}
	ExclusiveGateway_4 -->|"Yes"| ExclusiveGateway_1
	ExclusiveGateway_4 -->|"No"| ParallelGateway_1{"+"}
	ParallelGateway_1 --> Task_6["Receive first batch of parts"]
	ParallelGateway_1 --> Task_7["Receive second batch of parts"]
	ParallelGateway_1 --> Task_8["Receive third batch of parts"]
	Task_6 --> ExclusiveGateway_10{"First parts arrived"}
	Task_7 --> ExclusiveGateway_10
	Task_8 --> ExclusiveGateway_10
	ExclusiveGateway_10 --> Task_9["Start/Continue building"]
	Task_9 --> ExclusiveGateway_5{"Any stock falls?"}
	ExclusiveGateway_5 -->|"Yes"| ExclusiveGateway_7{"How much is the stock fall?"}
	Task_5["Reorder the part as fast as possible"] --> ExclusiveGateway_8{"X"}
	Task_4["Reorder the cheapest part"] --> ExclusiveGateway_8
	Task_10["Complain to the friends"] --> ExclusiveGateway_8
	ExclusiveGateway_8 --> ExclusiveGateway_6{"X"}
	ExclusiveGateway_5 -->|"No"| ExclusiveGateway_6
	ExclusiveGateway_7 -->|"Below 5"| Task_4
	ExclusiveGateway_7 -->|"Below 3"| Task_5
	ExclusiveGateway_7 -->|"Zero"| Task_10
	ExclusiveGateway_6 --> ExclusiveGateway_9{"Contract fullfilled?"}
	ExclusiveGateway_9 -->|"No"| Task_9
	ExclusiveGateway_9 -->|"Yes"| EndEvent_1(("Project completed"))
